ericevenchick/CANRelay/CANRelay/Project_Headers/mc9s08dz32.h
/*** PTDPE - Port D Pull Enable Register; 0x00001858 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPE0      :1;                                       /* Internal Pull Enable for Port D Bit 0 */
    byte PTDPE1      :1;                                       /* Internal Pull Enable for Port D Bit 1 */
    byte PTDPE2      :1;                                       /* Internal Pull Enable for Port D Bit 2 */
    byte PTDPE3      :1;                                       /* Internal Pull Enable for Port D Bit 3 */
    byte PTDPE4      :1;                                       /* Internal Pull Enable for Port D Bit 4 */
    byte PTDPE5      :1;                                       /* Internal Pull Enable for Port D Bit 5 */
    byte PTDPE6      :1;                                       /* Internal Pull Enable for Port D Bit 6 */
    byte PTDPE7      :1;                                       /* Internal Pull Enable for Port D Bit 7 */
  } Bits;
} PTDPESTR;
extern volatile PTDPESTR _PTDPE @0x00001858;
#define PTDPE                           _PTDPE.Byte
#define PTDPE_PTDPE0                    _PTDPE.Bits.PTDPE0
#define PTDPE_PTDPE1                    _PTDPE.Bits.PTDPE1
#define PTDPE_PTDPE2                    _PTDPE.Bits.PTDPE2
#define PTDPE_PTDPE3                    _PTDPE.Bits.PTDPE3
#define PTDPE_PTDPE4                    _PTDPE.Bits.PTDPE4
#define PTDPE_PTDPE5                    _PTDPE.Bits.PTDPE5
#define PTDPE_PTDPE6                    _PTDPE.Bits.PTDPE6
#define PTDPE_PTDPE7                    _PTDPE.Bits.PTDPE7

#define PTDPE_PTDPE0_MASK               1U
#define PTDPE_PTDPE1_MASK               2U
#define PTDPE_PTDPE2_MASK               4U
#define PTDPE_PTDPE3_MASK               8U
#define PTDPE_PTDPE4_MASK               16U
#define PTDPE_PTDPE5_MASK               32U
#define PTDPE_PTDPE6_MASK               64U
#define PTDPE_PTDPE7_MASK               128U


/*** PTDSE - Port D Slew Rate Enable Register; 0x00001859 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDSE0      :1;                                       /* Output Slew Rate Enable for Port D Bit 0 */
    byte PTDSE1      :1;                                       /* Output Slew Rate Enable for Port D Bit 1 */
    byte PTDSE2      :1;                                       /* Output Slew Rate Enable for Port D Bit 2 */
    byte PTDSE3      :1;                                       /* Output Slew Rate Enable for Port D Bit 3 */
    byte PTDSE4      :1;                                       /* Output Slew Rate Enable for Port D Bit 4 */
    byte PTDSE5      :1;                                       /* Output Slew Rate Enable for Port D Bit 5 */
    byte PTDSE6      :1;                                       /* Output Slew Rate Enable for Port D Bit 6 */
    byte PTDSE7      :1;                                       /* Output Slew Rate Enable for Port D Bit 7 */
  } Bits;
} PTDSESTR;
extern volatile PTDSESTR _PTDSE @0x00001859;
#define PTDSE                           _PTDSE.Byte
#define PTDSE_PTDSE0                    _PTDSE.Bits.PTDSE0
#define PTDSE_PTDSE1                    _PTDSE.Bits.PTDSE1
#define PTDSE_PTDSE2                    _PTDSE.Bits.PTDSE2
#define PTDSE_PTDSE3                    _PTDSE.Bits.PTDSE3
#define PTDSE_PTDSE4                    _PTDSE.Bits.PTDSE4
#define PTDSE_PTDSE5                    _PTDSE.Bits.PTDSE5
#define PTDSE_PTDSE6                    _PTDSE.Bits.PTDSE6
#define PTDSE_PTDSE7                    _PTDSE.Bits.PTDSE7

#define PTDSE_PTDSE0_MASK               1U
#define PTDSE_PTDSE1_MASK               2U
#define PTDSE_PTDSE2_MASK               4U
#define PTDSE_PTDSE3_MASK               8U
#define PTDSE_PTDSE4_MASK               16U
#define PTDSE_PTDSE5_MASK               32U
#define PTDSE_PTDSE6_MASK               64U
#define PTDSE_PTDSE7_MASK               128U


/*** PTDDS - Port D Drive Strength Selection Register; 0x0000185A ***/
typedef union {
  byte Byte;
  struct {
    byte PTDDS0      :1;                                       /* Output Drive Strength Selection for Port D Bit 0 */
    byte PTDDS1      :1;                                       /* Output Drive Strength Selection for Port D Bit 1 */
    byte PTDDS2      :1;                                       /* Output Drive Strength Selection for Port D Bit 2 */
    byte PTDDS3      :1;                                       /* Output Drive Strength Selection for Port D Bit 3 */
    byte PTDDS4      :1;                                       /* Output Drive Strength Selection for Port D Bit 4 */
    byte PTDDS5      :1;                                       /* Output Drive Strength Selection for Port D Bit 5 */
    byte PTDDS6      :1;                                       /* Output Drive Strength Selection for Port D Bit 6 */
    byte PTDDS7      :1;                                       /* Output Drive Strength Selection for Port D Bit 7 */
  } Bits;
} PTDDSSTR;
extern volatile PTDDSSTR _PTDDS @0x0000185A;
#define PTDDS                           _PTDDS.Byte
#define PTDDS_PTDDS0                    _PTDDS.Bits.PTDDS0
#define PTDDS_PTDDS1                    _PTDDS.Bits.PTDDS1
#define PTDDS_PTDDS2                    _PTDDS.Bits.PTDDS2
#define PTDDS_PTDDS3                    _PTDDS.Bits.PTDDS3
#define PTDDS_PTDDS4                    _PTDDS.Bits.PTDDS4
#define PTDDS_PTDDS5                    _PTDDS.Bits.PTDDS5
#define PTDDS_PTDDS6                    _PTDDS.Bits.PTDDS6
#define PTDDS_PTDDS7                    _PTDDS.Bits.PTDDS7

#define PTDDS_PTDDS0_MASK               1U
#define PTDDS_PTDDS1_MASK               2U
#define PTDDS_PTDDS2_MASK               4U
#define PTDDS_PTDDS3_MASK               8U
#define PTDDS_PTDDS4_MASK               16U
#define PTDDS_PTDDS5_MASK               32U
#define PTDDS_PTDDS6_MASK               64U
#define PTDDS_PTDDS7_MASK               128U


/*** PTDSC - Port D Interrupt Status and Control Register; 0x0000185C ***/
typedef union {
  byte Byte;
  struct {
    byte PTDMOD      :1;                                       /* Port D Detection Mode */
    byte PTDIE       :1;                                       /* Port D Interrupt Enable */
    byte PTDACK      :1;                                       /* Port D Interrupt Acknowledge */
    byte PTDIF       :1;                                       /* Port D Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTDSCSTR;
extern volatile PTDSCSTR _PTDSC @0x0000185C;
#define PTDSC                           _PTDSC.Byte
#define PTDSC_PTDMOD                    _PTDSC.Bits.PTDMOD
#define PTDSC_PTDIE                     _PTDSC.Bits.PTDIE
#define PTDSC_PTDACK                    _PTDSC.Bits.PTDACK
#define PTDSC_PTDIF                     _PTDSC.Bits.PTDIF

#define PTDSC_PTDMOD_MASK               1U
#define PTDSC_PTDIE_MASK                2U
#define PTDSC_PTDACK_MASK               4U
#define PTDSC_PTDIF_MASK                8U


/*** PTDPS - Port D Interrupt Pin Select Register; 0x0000185D ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPS0      :1;                                       /* Port D Interrupt Pin Select Bit 0 */
    byte PTDPS1      :1;                                       /* Port D Interrupt Pin Select Bit 1 */
    byte PTDPS2      :1;                                       /* Port D Interrupt Pin Select Bit 2 */
    byte PTDPS3      :1;                                       /* Port D Interrupt Pin Select Bit 3 */
    byte PTDPS4      :1;                                       /* Port D Interrupt Pin Select Bit 4 */
    byte PTDPS5      :1;                                       /* Port D Interrupt Pin Select Bit 5 */
    byte PTDPS6      :1;                                       /* Port D Interrupt Pin Select Bit 6 */
    byte PTDPS7      :1;                                       /* Port D Interrupt Pin Select Bit 7 */
  } Bits;
} PTDPSSTR;
extern volatile PTDPSSTR _PTDPS @0x0000185D;
#define PTDPS                           _PTDPS.Byte
#define PTDPS_PTDPS0                    _PTDPS.Bits.PTDPS0
#define PTDPS_PTDPS1                    _PTDPS.Bits.PTDPS1
#define PTDPS_PTDPS2                    _PTDPS.Bits.PTDPS2
#define PTDPS_PTDPS3                    _PTDPS.Bits.PTDPS3
#define PTDPS_PTDPS4                    _PTDPS.Bits.PTDPS4
#define PTDPS_PTDPS5                    _PTDPS.Bits.PTDPS5
#define PTDPS_PTDPS6                    _PTDPS.Bits.PTDPS6
#define PTDPS_PTDPS7                    _PTDPS.Bits.PTDPS7

#define PTDPS_PTDPS0_MASK               1U
#define PTDPS_PTDPS1_MASK               2U
#define PTDPS_PTDPS2_MASK               4U
#define PTDPS_PTDPS3_MASK               8U
#define PTDPS_PTDPS4_MASK               16U
#define PTDPS_PTDPS5_MASK               32U
#define PTDPS_PTDPS6_MASK               64U
#define PTDPS_PTDPS7_MASK               128U


