ericevenchick/CANRelay/CANRelay/Project_Headers/mc9s08dz32.h
    #define CANTIDR2_ID7_MASK           1U
    #define CANTIDR2_ID8_MASK           2U
    #define CANTIDR2_ID9_MASK           4U
    #define CANTIDR2_ID10_MASK          8U
    #define CANTIDR2_ID11_MASK          16U
    #define CANTIDR2_ID12_MASK          32U
    #define CANTIDR2_ID13_MASK          64U
    #define CANTIDR2_ID14_MASK          128U
    

    /*** CANTIDR3 - MSCAN 0 Transmit Identifier Register 3; 0x000018B3 ***/
    union {
      byte Byte;
      struct {
        byte RTR         :1;                                       /* Remote Transmission Request */
        byte ID0         :1;                                       /* Extended format identifier Bit 0 */
        byte ID1         :1;                                       /* Extended format identifier Bit 1 */
        byte ID2         :1;                                       /* Extended format identifier Bit 2 */
        byte ID3         :1;                                       /* Extended format identifier Bit 3 */
        byte ID4         :1;                                       /* Extended format identifier Bit 4 */
        byte ID5         :1;                                       /* Extended format identifier Bit 5 */
        byte ID6         :1;                                       /* Extended format identifier Bit 6 */
      } Bits;
      struct {
        byte     :1;
        byte grpID :7;
      } MergedBits;
    } CANTIDR3STR;
    #define CANTIDR3                    _CANTIDR.Overlap_STR.CANTIDR3STR.Byte
    #define CANTIDR3_RTR                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.RTR
    #define CANTIDR3_ID0                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID0
    #define CANTIDR3_ID1                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID1
    #define CANTIDR3_ID2                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID2
    #define CANTIDR3_ID3                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID3
    #define CANTIDR3_ID4                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID4
    #define CANTIDR3_ID5                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID5
    #define CANTIDR3_ID6                _CANTIDR.Overlap_STR.CANTIDR3STR.Bits.ID6
    #define CANTIDR3_ID                 _CANTIDR.Overlap_STR.CANTIDR3STR.MergedBits.grpID
    
    #define CANTIDR3_RTR_MASK           1U
    #define CANTIDR3_ID0_MASK           2U
    #define CANTIDR3_ID1_MASK           4U
    #define CANTIDR3_ID2_MASK           8U
    #define CANTIDR3_ID3_MASK           16U
    #define CANTIDR3_ID4_MASK           32U
    #define CANTIDR3_ID5_MASK           64U
    #define CANTIDR3_ID6_MASK           128U
    #define CANTIDR3_ID_MASK            254U
    #define CANTIDR3_ID_BITNUM          1U
    
  } Overlap_STR;

} CANTIDRSTR;
extern volatile CANTIDRSTR _CANTIDR @0x000018B0;
#define CANTIDR                         _CANTIDR.Dword


/*** CANTDSR0 - MSCAN Transmit Data Segment Register 0; 0x000018B4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CANTDSR0STR;
extern volatile CANTDSR0STR _CANTDSR0 @0x000018B4;
#define CANTDSR0                        _CANTDSR0.Byte
#define CANTDSR0_DB0                    _CANTDSR0.Bits.DB0
#define CANTDSR0_DB1                    _CANTDSR0.Bits.DB1
#define CANTDSR0_DB2                    _CANTDSR0.Bits.DB2
#define CANTDSR0_DB3                    _CANTDSR0.Bits.DB3
#define CANTDSR0_DB4                    _CANTDSR0.Bits.DB4
#define CANTDSR0_DB5                    _CANTDSR0.Bits.DB5
#define CANTDSR0_DB6                    _CANTDSR0.Bits.DB6
#define CANTDSR0_DB7                    _CANTDSR0.Bits.DB7
/* CANTDSR_ARR: Access 8 CANTDSRx registers in an array */
#define CANTDSR_ARR                     ((volatile byte * __far) &CANTDSR0)

#define CANTDSR0_DB0_MASK               1U
#define CANTDSR0_DB1_MASK               2U
#define CANTDSR0_DB2_MASK               4U
#define CANTDSR0_DB3_MASK               8U
#define CANTDSR0_DB4_MASK               16U
#define CANTDSR0_DB5_MASK               32U
#define CANTDSR0_DB6_MASK               64U
#define CANTDSR0_DB7_MASK               128U


/*** CANTDSR1 - MSCAN Transmit Data Segment Register 1; 0x000018B5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CANTDSR1STR;
extern volatile CANTDSR1STR _CANTDSR1 @0x000018B5;
#define CANTDSR1                        _CANTDSR1.Byte
#define CANTDSR1_DB0                    _CANTDSR1.Bits.DB0
#define CANTDSR1_DB1                    _CANTDSR1.Bits.DB1
#define CANTDSR1_DB2                    _CANTDSR1.Bits.DB2
#define CANTDSR1_DB3                    _CANTDSR1.Bits.DB3
#define CANTDSR1_DB4                    _CANTDSR1.Bits.DB4
#define CANTDSR1_DB5                    _CANTDSR1.Bits.DB5
#define CANTDSR1_DB6                    _CANTDSR1.Bits.DB6
#define CANTDSR1_DB7                    _CANTDSR1.Bits.DB7

#define CANTDSR1_DB0_MASK               1U
#define CANTDSR1_DB1_MASK               2U
#define CANTDSR1_DB2_MASK               4U
#define CANTDSR1_DB3_MASK               8U
#define CANTDSR1_DB4_MASK               16U
#define CANTDSR1_DB5_MASK               32U
#define CANTDSR1_DB6_MASK               64U
#define CANTDSR1_DB7_MASK               128U


